'''
Создать функцию is_polyndrom(num: int)→ int:
которая проверяет, является ли строчное представление
заданного числа палиндромом в какой нибудь системе счисления.
На вход подается число, функция возвращает основание системы
счисления, в которой число является палиндромом.
В качестве основания системы счисления сможет выступать
любое число от 2 до 36. Если таких систем счисления
существует несколько, то вернуть наименьшее основание.
Если такой системы счисления не существует,
то функция должна вернуть 0.
'''


def is_polyndrom(n: int) -> int:
    pass
